
/* 3.利用记事本编写Java程序，要求输出“
软件工程师的基本要求，树立软件产业界整体优良形象：
01  自觉遵守公民道德规范标准和中国软件行业基本公约。 
02  讲诚信， 坚决反对各种弄虚作假现象，忠实做好各种作业记录，不隐瞒、不虚构，对提交的软件产品和及其功能，在有关文档上不作夸大不实的说明。 
03  讲团结、讲合作，有良好的团队协作精神，善于沟通和交流。 
04  有良好的知识产权保护观念，自觉抵制各种违反知识产权保护法规的行为，不购买和使用盗版的软件，不参与侵犯知识产权的活动，在自己开发的产品中不拷贝、复用未获得使用许可的他方内容。 
05  树立正确的技能观，努力提高自己的技能，为社会和人类造福，绝不利用自己的技能去从事危害公众利益的活动。”
 */
class Put {
    public static void main(String[] args) {
        System.out.print("\"软件工程师的基本要求，树立软件产业界整体优良形象：\r\n" + //
                "01  自觉遵守公民道德规范标准和中国软件行业基本公约。 \r\n" + //
                "02  讲诚信， 坚决反对各种弄虚作假现象，忠实做好各种作业记录，不隐瞒、不虚构，对提交的软件产品和及其功能，在有关文档上不作夸大不实的说明。 \r\n" + //
                "03  讲团结、讲合作，有良好的团队协作精神，善于沟通和交流。 \r\n" + //
                "04  有良好的知识产权保护观念，自觉抵制各种违反知识产权保护法规的行为，不购买和使用盗版的软件，不参与侵犯知识产权的活动，在自己开发的产品中不拷贝、复用未获得使用许可的他方内容。 \r\n" + //
                "05  树立正确的技能观，努力提高自己的技能，为社会和人类造福，绝不利用自己的技能去从事危害公众利益的活动。”");

    }
}